Revit 2027 API
ParameterTypeId.LegendComponentView Property
 "View Direction"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId LegendComponentView { get; }
Public Shared ReadOnly Property LegendComponentView As ForgeTypeId
	Get
public:
static property ForgeTypeId^ LegendComponentView {
	ForgeTypeId^ get ();
}
static member LegendComponentView : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace